app/controllers/oyoyos_controller.rb

SELECT * FROM `oyoyos` WHERE (`oyoyos`.`id` = 1)
---
  def show
    @oyoyo = Oyoyo.find(params[:id])

SELECT * FROM `oyoyos`
---
  def list
  @oyoyos = Oyoyo.find (:all)

SELECT * FROM `oyoyos` WHERE (`oyoyos`.`id` = 2)
---
  def edit
    @oyoyo = Oyoyo.find(params[:id])

INSERT INTO `oyoyos` (`name`, `updated_at`, `date`, `comment`, `created_at`) VALUES('dvjfhi bf', '2009-05-29 03:00:03', '2009-05-29', 'iohrighr', '2009-05-29 03:00:03')
---
  def create
    @oyoyo = Oyoyo.new(params[:oyoyo])

    respond_to do |format|
      if @oyoyo.save

SELECT * FROM `oyoyos` WHERE (`oyoyos`.`id` = 2)
---
  def update
    @oyoyo = Oyoyo.find(params[:id])

SELECT * FROM `oyoyos` WHERE (`oyoyos`.`id` = 3)
DELETE FROM `oyoyos` WHERE `id` = 3
---
  def destroy
    @oyoyo = Oyoyo.find(params[:id])
    @oyoyo.destroy

SELECT * FROM `oyoyos` WHERE (comment LIKE '%uu%')
---
def search
    @oyoyos = Oyoyo.find(:all, :conditions => ["name LIKE ?", "%#{params[:key]}%"]) |